Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightFailure
The column can't have zero height

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnZeroHeightError
The column can't have zero height

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseFailure
The column top can't be moved below its base.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseError
The column top can't be moved below its base.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnJoinNonhitFailure
The highlighted column can't maintain attachment to the target.  It will be treated as unattached until it can intersect.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopFailure
The column base can't be moved above its top.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnBaseAboveTopError
The column base can't be moved above its top.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnAndTargetAreConcrete
Column and target are both concrete. Geometries have been joined.

Autodesk.Revit.DB.BuiltInFailures.ColumnFailures
Failures about Columns.